In [31]:
import sqlite3
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
from datetime import datetime

Preparing match DF

In [3]:
path = 'data/database.sqlite'

In [4]:
connection = sqlite3.connect(path)

In [43]:
query = '''
  SELECT * 
  FROM Match
'''
match_df = pd.read_sql_query(query, connection)
match_df

,id,country_id,league_id,season,stage,date,match_api_id,home_team_api_id,away_team_api_id,home_team_goal,...,SJA,VCH,VCD,VCA,GBH,GBD,GBA,BSH,BSD,BSA
0,1,1,1,2008/2009,1,2008-08-17 00:00:00,492473,9987,9993,1,...,4.00,1.65,3.40,4.50,1.78,3.25,4.00,1.73,3.40,4.20
1,2,1,1,2008/2009,1,2008-08-16 00:00:00,492474,10000,9994,0,...,3.80,2.00,3.25,3.25,1.85,3.25,3.75,1.91,3.25,3.60
2,3,1,1,2008/2009,1,2008-08-16 00:00:00,492475,9984,8635,0,...,2.50,2.35,3.25,2.65,2.50,3.20,2.50,2.30,3.20,2.75
3,4,1,1,2008/2009,1,2008-08-17 00:00:00,492476,9991,9998,5,...,7.50,1.45,3.75,6.50,1.50,3.75,5.50,1.44,3.75,6.50
4,5,1,1,2008/2009,1,2008-08-16 00:00:00,492477,7947,9985,1,...,1.73,4.50,3.40,1.65,4.50,3.50,1.65,4.75,3.30,1.67
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
25974,25975,24558,24558,2015/2016,9,2015-09-22 00:00:00,1992091,10190,10191,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25975,25976,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992092,9824,10199,1,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25976,25977,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992093,9956,10179,2,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25977,25978,24558,24558,2015/2016,9,2015-09-22 00:00:00,1992094,7896,10243,0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25978,25979,24558,24558,2015/2016,9,2015-09-23 00:00:00,1992095,10192,9931,4,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [47]:
format_data = "%Y-%m-%d %H:%M:%S"
match_df['date'] = match_df['date'].apply(lambda x: datetime.strptime(x, format_data))

0       2008-08-17
1       2008-08-16
2       2008-08-16
3       2008-08-17
4       2008-08-16
           ...
25974   2015-09-22
25975   2015-09-23
25976   2015-09-23
25977   2015-09-22
25978   2015-09-23
Name: date, Length: 25979, dtype: datetime64[ns]

In [48]:
identification_cols = ['id', 'country_id', 'league_id', 'season', 'stage', 'date', 'match_api_id', 'home_team_api_id', 'away_team_api_id', 'home_team_goal', 'away_team_goal', 'goal', 'shoton', 'shotoff', 'possession']
betting_cols = list(match_df.columns[-30:]) 
cols = identification_cols + betting_cols
match_df = match_df[cols]

In [49]:
for res in ['H', 'D', 'A']:
    match_df[f'mean_bet_{res}'] = match_df[[col for col in betting_cols if col[-1] == res]].mean(axis=1)

C:\Users\EB\AppData\Local\Temp/ipykernel_1188/3007036654.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  match_df[f'mean_bet_{res}'] = match_df[[col for col in betting_cols if col[-1] == res]].mean(axis=1)

In [50]:
match_df = match_df[identification_cols + [f'mean_bet_{res}' for res in ['H', 'D', 'A']]]

In [51]:
print(list(match_df.columns))

['id', 'country_id', 'league_id', 'season', 'stage', 'date', 'match_api_id', 'home_team_api_id', 'away_team_api_id', 'home_team_goal', 'away_team_goal', 'goal', 'shoton', 'shotoff', 'possession', 'mean_bet_H', 'mean_bet_D', 'mean_bet_A']

A df with all the wins, we can use this as part of x to describe how good a team is in a given season

In [52]:
wins = pd.read_sql_query("""
  SELECT season, home_team_api_id, home_team AS team, SUM(home_win + away_win) as wins 
  FROM
    (
    SELECT MATCH.id, MATCH.home_team_api_id, Match.season, t1.team_long_name as home_team, t2.team_long_name as away_team,
      (CASE WHEN home_team_goal > away_team_goal THEN 1 ELSE 0 END) AS home_win,
      (CASE WHEN home_team_goal = away_team_goal THEN 1 ELSE 0 END) AS draw,
      (CASE WHEN home_team_goal < away_team_goal THEN 1 ELSE 0 END) AS away_win
    FROM MATCH 
    JOIN TEAM as t1 ON t1.team_api_id = MATCH.home_team_api_id 
    JOIN TEAM as t2 ON t2.team_api_id = MATCH.away_team_api_id
    WHERE league_id = 1729)
    GROUP BY home_team, season
    ORDER BY season DESC, wins DESC
  """, connection)

In [53]:
wins

        season  home_team_api_id              team  wins
0    2015/2016              8456   Manchester City    17
1    2015/2016              8466       Southampton    16
2    2015/2016              9826    Crystal Palace    16
3    2015/2016             10194        Stoke City    15
4    2015/2016              9825           Arsenal    15
..         ...               ...               ...   ...
155  2008/2009             10261  Newcastle United    12
156  2008/2009              8650         Liverpool    12
157  2008/2009              8655  Blackburn Rovers    12
158  2008/2009              8549     Middlesbrough    10
159  2008/2009             10252       Aston Villa    10

[160 rows x 4 columns]

In [54]:
team = pd.read_sql_query("""SELECT * FROM TEAM""", connection)

In [55]:
team

        id  team_api_id  team_fifa_api_id      team_long_name team_short_name
0        1         9987             673.0            KRC Genk             GEN
1        2         9993             675.0        Beerschot AC             BAC
2        3        10000           15005.0    SV Zulte-Waregem             ZUL
3        4         9994            2007.0    Sporting Lokeren             LOK
4        5         9984            1750.0   KSV Cercle Brugge             CEB
..     ...          ...               ...                 ...             ...
294  49479        10190             898.0       FC St. Gallen             GAL
295  49837        10191            1715.0             FC Thun             THU
296  50201         9777             324.0         Servette FC             SER
297  50204         7730            1862.0  FC Lausanne-Sports             LAU
298  51606         7896               NaN              Lugano             LUG

[299 rows x 5 columns]

In [57]:
df = match_df[match_df['league_id'] == 1729].copy().reset_index()
df['goal_diff'] = df['home_team_goal'] - df['away_team_goal']
df = df[['match_api_id', 'season', 'date', 'home_team_api_id', 'away_team_api_id', 'goal_diff', 'mean_bet_H', 'mean_bet_D', 'mean_bet_A']]
df

,match_api_id,season,date,home_team_api_id,away_team_api_id,goal_diff,mean_bet_H,mean_bet_D,mean_bet_A
0,489042,2008/2009,2008-08-17,10260,10261,0,1.278889,4.822222,10.083333
1,489043,2008/2009,2008-08-16,9825,8659,1,1.208889,5.522222,12.222222
2,489044,2008/2009,2008-08-16,8472,8650,-1,4.925556,3.450000,1.671111
3,489045,2008/2009,2008-08-16,8654,8528,1,1.874444,3.283333,3.938889
4,489046,2008/2009,2008-08-17,10252,8456,2,1.914444,3.277778,3.814444
...,...,...,...,...,...,...,...,...,...
3035,1988795,2015/2016,2015-10-17,8466,8197,0,1.765714,3.711429,4.814286
3036,1988796,2015/2016,2015-10-19,10003,10194,-1,2.047143,3.315714,3.958571
3037,1988797,2015/2016,2015-10-17,8586,8650,0,2.475714,3.377143,2.938571
3038,1988798,2015/2016,2015-10-17,9817,9825,-3,5.791429,4.044286,1.607143
3039,1988799,2015/2016,2015-10-17,8659,8472,1,2.032857,3.295714,4.038571

In [58]:
df['date'][0]

Timestamp('2008-08-17 00:00:00')

In [62]:
groups = df.set_index('date').groupby('home_team_api_id')
for i, group in groups:
    print(i)
    print(group.sort_index())
    for season, season_df in gr
    next_game = data.iloc[1:]
    prev_game = groups.copy()

8191
            match_api_id     season  home_team_api_id  away_team_api_id  \
date
2009-08-19        658589  2009/2010              8191             10260
2009-08-23        658601  2009/2010              8191              8668
2009-09-19        658631  2009/2010              8191              8472
2009-10-03        658684  2009/2010              8191              8658
2009-10-24        658699  2009/2010              8191              8528
2009-10-31        658713  2009/2010              8191              8667
2009-11-21        658792  2009/2010              8191             10252
2009-12-12        658826  2009/2010              8191              9879
2009-12-16        658834  2009/2010              8191              9825
2009-12-26        658923  2009/2010              8191              8559
2010-01-30        658973  2009/2010              8191              8455
2010-02-06        659020  2009/2010              8191              8654
2010-02-27        659096  2009/2010              8191              8462
2010-03-10        658942  2009/2010              8191             10194
2010-03-13        659116  2009/2010              8191              8602
2010-03-28        659137  2009/2010              8191              8655
2010-04-03        659145  2009/2010              8191              8456
2010-04-25        659175  2009/2010              8191              8650
2010-05-09        659372  2009/2010              8191              8586
2014-08-18       1723983  2014/2015              8191              8455
2014-08-30       1724003  2014/2015              8191             10260
2014-09-20       1724023  2014/2015              8191              8472
2014-10-18       1724053  2014/2015              8191              8654
2014-10-26       1724062  2014/2015              8191              8668
2014-11-08       1724082  2014/2015              8191              8667
2014-11-29       1724102  2014/2015              8191             10252
2014-12-02       1724113  2014/2015              8191             10261
2014-12-13       1724133  2014/2015              8191              8466
2014-12-26       1724153  2014/2015              8191              8650
2015-01-10       1724183  2014/2015              8191             10172
2015-01-17       1724193  2014/2015              8191              9826
2015-02-08       1724213  2014/2015              8191              8659
2015-02-28       1724243  2014/2015              8191             10003
2015-03-14       1724263  2014/2015              8191              8456
2015-04-05       1724283  2014/2015              8191              8586
2015-04-11       1724292  2014/2015              8191              9825
2015-04-25       1724313  2014/2015              8191              8197
2015-05-16       1724342  2014/2015              8191             10194

            goal_diff  mean_bet_H  mean_bet_D  mean_bet_A
date
2009-08-19          1    9.944444    4.722222    1.317778
2009-08-23          1    3.194444    3.244444    2.227778
2009-09-19          2    2.767778    3.227778    2.494444
2009-10-03          1    2.227778    3.238889    3.133333
2009-10-24         -2    2.397778    3.250000    2.895556
2009-10-31          2    1.912222    3.333333    3.992222
2009-11-21          0    3.244444    3.288889    2.205556
2009-12-12          0    2.583333    3.238889    2.685556
2009-12-16          0    6.777778    4.064444    1.487778
2009-12-26          0    2.313333    3.261111    3.007778
2010-01-30         -1   11.111111    4.950000    1.287778
2010-02-06          1    2.533333    3.227778    2.783333
2010-02-27         -1    2.044444    3.344444    3.588889
2010-03-10          0    2.470000    3.205556    2.751111
2010-03-13         -1    2.253333    3.227778    3.205556
2010-03-28         -1    2.573333    3.244444    2.657778
2010-04-03         -5    4.894444    3.605556    1.692222
2010-04-25         -4    5.627778    3.866667    1.580000
2010-05-09          2    6.516667    4.092222    1.486667
2014-08-18         -2    8.633750    4.663750    1.401250
2014-08-30          0    5.932500    3.935000    1.610000
2014-09-20          0    2.541429    3.230000    2.948571
2014-10-18         -2    2.780000    3.252857    2.692857
2014-10-26         -2    4.471429    3.658571    1.825714
2014-11-08          1    2.545714    3.244286    2.895714
2014-11-29          0    2.164286    3.268571    3.550000
2014-12-02          0    2.788571    3.205714    2.698571
2014-12-13          1    5.035714    3.578571    1.767143
2014-12-26         -1    4.457143    3.688571    1.818571
2015-01-10          1    2.194286    3.331429    3.435714
2015-01-17         -1    2.502857    3.217143    3.028571
2015-02-08          0    2.594286    3.204286    2.881429
2015-02-28         -1    2.638571    3.257143    2.812857
2015-03-14          1    7.231429    4.592857    1.447143
2015-04-05          0    3.471429    3.447143    2.132857
2015-04-11         -1    6.321429    4.158571    1.554286
2015-04-25         -1    2.542857    3.260000    2.921429
2015-05-16          0    2.665714    3.262857    2.778571